/**
 * cigweb相关错误响应码
 */
export const LOCAL_RECORD_CODE_MAP = {
  /**
   * camera local video control not enabled
   */
  '141221': 141221,
  /**
   * 20001	在规定时间内盒子没有上报播放本地录像的操作结果
   */
  '20001': 20001,
  /**
   * 20002	没有本地录像时间轴
   */
  '20002': 20002,
  /**
   * 40200	设备离线
   */
  '40200': 40200,
  /**
   * 40404	云通道不存在
   */
  '40404': 40404,
  /**
   * 50010	获取本地录像时间轴失败
   */
  '50010': 50010,
  /**
   * 50011	获取录像视频数据失败
   */
  '50011': 50011,
  /**
   * 50012	连接流媒体服务失败
   */
  '50012': 50012,
  /**
   * 50013	录像视频数据推流失败
   */
  '50013': 50013,
};

export const COOKIE_LIST = ['token', 'account'];
